{
  "basics": {
    "name": "Brett Schwarz",
    "label": "Cloud Architect & Software Engineer",
    "summary": "Certified Senior Cloud Architect & Software Engineer with experience leading cross-functional teams, architecting large-scale cloud applications, and collaborating with product owners and stakeholders to deliver end-to-end solutions. Deep expertise in API design, system architecture, and agile development.",
    "email": "brett.schwarz@gmail.com",
    "phone": "+1-425-466-1731",
    "website": "bschwarz.github.io",
    "location": {
      "address": "",
      "city": "Seattle",
      "region": "Washington",
      "postalCode": "98141",
      "countryCode": "US"
    },
    "profiles": [
      {
        "network": "linkedin",
        "username": "brettschwarz",
        "url": "https://www.linkedin.com/in/brettschwarz"
      }
    ]
  },
  "work": [
    {
      "company": "Amazon Web Services",
      "summary": "AWS Professional Services - assisting customers with planning and executing solution build-outs on AWS, balancing technical design with business needs",
      "position": "Senior Cloud Application Architect",
      "startDate": "2021-02-22",
      "highlights": [
        "Directed a 10-person core engineering team, plus 15+ cross-functional contributors, to build a multi-tenant Smart Home platform using microservices architecture (over 120 scalable RESTful API operations) and blue/green deployments, supporting millions of devices.",
        "Led end-to-end application development for a Smart Devices platform, overseeing API design, secure authentication/authorization flows, mobile push notifications, and real-time communication via WebSockets.",
        "Architected and led a telecom-scale frontend and identity solution, delivering a secure authentication/authorization system in compliance with strict enterprise security requirements, while facilitating collaboration between US and APAC engineers.",
        "Implemented a cloud-native workflow engine using AWS services, enabling orchestration and automation of critical business processes.",
        "Automated testing and defect tracking for a major mobile operator by building a cloud-based data ingestion system with RESTful APIs and AWS services, supporting future ML initiatives.",
        "Created a full-stack, web-based internal API management tool using AWS services, improving API lifecycle control and developer efficiency.",
        "Designed and developed an internal web-based API management tool (full stack) that integrates into existing systems. Developed a custom application with an event-driven architecture using AWS services."
      ]
    },
    {
      "company": "AT&T",
      "summary": "Company wide API standards, governance, and best practices. API design, architecture, and development. Machine Learning platform architecture and development.",
      "position": "Principal Technical Architect",
      "startDate": "2015-06-01",
      "endDate": "2018-01-01",
      "highlights": [
        "Managed stakeholder alignment across product, design, and engineering to successfully deliver a distributed ML platform with containerized microservices, REST APIs, cloud-native data stores, and a web application.",
        "Migrated the entire ML platform to Microsoft Azure, improving system scalability and reducing infrastructure spend.",
        "Created an internal REST API design tool, reducing delivery time by 50% with Kubernetes deployment.",
        "Established best practices for REST web services across all of AT&T as a member of the internal standards team."
      ]
    },
    {
      "company": "Sentaca",
      "summary": "",
      "position": "Solutions Architect",
      "startDate": "2011-06-01",
      "endDate": "2015-05-01",
      "highlights": [
        "Achieved high customer satisfaction by ensuring optimal API solutions by collaborating with customers and internal architecture teams.",
        "Lead and mentored a team of 8-10 engineers for the developer program.",
        "Promoted API solutions at conferences and hack-a-thons by educating and demonstrating to customers the solution’s capabilities.",
        "Implemented a new API documentation system which reduced delivery time by 30%."
      ]
    },
    {
      "company": "AT&T",
      "summary": "",
      "position": "Senior Test Engineer",
      "startDate": "2010-10-01",
      "endDate": "2011-06-01",
      "highlights": [
        "Ensured optimal API solutions through collaboration with customers and architecture teams.",
        "Led and mentored a team of 8–10 engineers.",
        "Developed a new API documentation system, reducing delivery time by 30%."
      ]
    },
    {
      "company": "T-Mobile",
      "summary": "",
      "position": "Senior Engineer",
      "startDate": "2010-05-01",
      "endDate": "2010-10-01",
      "highlights": [
        "Designed, engineered, and supervised subscriber-based mobile network elements.",
        "Successfully lead the engineering team on a complex (total replacement) subscriber migration across the entire network.",
        "Developed tools to streamline the implementation and troubleshooting of services."
      ]
    },
    {
      "company": "Alcatel-Lucent",
      "summary": "",
      "position": "Technical Sales Engineer",
      "startDate": "2008-08-01",
      "endDate": "2009-09-01",
      "highlights": [
        "Achieved highest-ranked sales engineer status by assisting the sales team to secure a major strategic win.",
        "Supported the sales team with technical expertise for product presentations and consultations to the customer up to the VP level."
      ]
    },
    {
      "company": "Alcatel-Lucent",
      "summary": "",
      "position": "Senior Network Systems Engineer",
      "startDate": "2005-11-01",
      "endDate": "2008-08-01",
      "highlights": [
        "Headed the performance optimization customer team from an engineering and project management role, and improved network performance by 10%.",
        "Accelerated customer’s understanding of the products by providing presentations and weekly performance updates to the customer up to the VP level, on the core network (GSM, UMTS).",
        "Reduced turnaround time and increased effectiveness of statistics reporting by developing an internal web-based reporting tool (ETL, server, and client-side).",
        "Collaborated with development and system engineering on performance issues to improve the product’s performance."
      ]
    },
    {
      "company": "HMS Software",
      "summary": "",
      "position": "Implementation Engineer",
      "startDate": "2005-01-01",
      "endDate": "2005-11-01",
      "highlights": [
        "Translated requirements from the customer into customized code that implemented new features into our standard software product (manufacturing ERP).",
        "Performed testing, managed all bug fixes, and collaborated with the customer on the integration of the solution.",
        "Increased productivity by mentoring other engineers in the Tcl programming language.",
        "Optimized legacy code by conforming code to new features."
      ]
    },
    {
      "company": "ATT Wireless",
      "summary": "",
      "position": "Senior Engineer",
      "startDate": "2003-04-01",
      "endDate": "2004-12-01",
      "highlights": [
        "Engineered messaging platforms (e.g. SMSCs) within the company's mobile network.",
        "Worked with the vendor to find the optimal solution and verification of the solution.",
        "Reduced response time and improved quality by developing several software tools."
      ]
    },
    {
      "company": "PacketVideo Corporation",
      "summary": "",
      "position": "Lead Network Engineer",
      "startDate": "2000-06-01",
      "endDate": "2002-04-01",
      "highlights": [
        "Designed, tested, and integrated the server (Linux) platform installation for both domestic and internal integrations.",
        "Lead the first complete integration effort of the product line into the customer’s network (JSP and servlets on Apache/Tomcat).",
        "Significantly reduced cycle time and improved quality by developing a customized RedHat Linux Kickstart installation for field installations and sales demos.",
        "Improved internal communication by developing a web application for installation activities, knowledge base, and configuration generation.",
        "Provided pre-sales and post-sales support, including presentations for the customers globally."
      ]
    },
    {
      "company": "Motorola",
      "summary": "",
      "position": "Lead Systems Engineer",
      "startDate": "1996-10-01",
      "endDate": "2000-06-01",
      "highlights": [
        "Designed, tested and integrated products into the customer’s mobile network, for both domestic and international customers.",
        "Lead several major network changeouts for the engineering team.",
        "Enhanced subscriber accessibility by developing procedures and software tools to migrate/modify subscribers efficiently and in a significantly reduced time frame."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Toledo",
      "area": "Electrical Engineering",
      "studyType": "Bachelor of Science",
      "startDate": "1988-09-01",
      "endDate": "1991-12-01"
    },
    {
      "institution": "University of Toledo",
      "area": "Mathematics",
      "studyType": "Bachelor of Science",
      "startDate": "1988-09-01",
      "endDate": "1991-12-01"
    },
    {
      "institution": "Udacity",
      "area": "Frontend Web Developer",
      "studyType": "Nanodegree",
      "startDate": "2017-01-01",
      "endDate": "2018-01-01"
    },
    {
      "institution": "Udacity",
      "area": "Machine Learning Engineer",
      "studyType": "Nanodegree",
      "startDate": "2020-08-15",
      "endDate": "2020-12-15"
    }
  ],
  "publications": [
    {
      "name": "Asterisk Open-Source PBX System",
      "publisher": "Linux Journal",
      "website": "http://www.linuxjournal.com/article/6769",
      "summary": "Use one system to manage voice over IP and conventional phone lines, manage voice mail and run CGI-like applications for phone users.",
      "releaseDate": "2004-02-01"
    },
    {
      "name": "Hacking Red Hat Kickstart",
      "publisher": "Linux Journal",
      "website": "http://www.linuxjournal.com/article/6473",
      "summary": "How to create a single CD for fast and easy customized installation.",
      "releaseDate": "2003-04-01"
    }
  ],
  "skills": [
    {
      "name": "Certifications",
      "level": "5",
      "keywords": [
        "AWS Certified Solutions Architect - Professional",
        "AWS Certified Solutions Architect - Associate",
        "AWS Certified Machine Learning - Associate",
        "AWS Certified Developer Associate",
        "AWS Certified AI Practitioner",
        "AWS Certified Cloud Practitioner",
        "Microsoft Certified: Azure Fundamentals"
      ]
    },
    {
      "name": "AWS Services",
      "level": "5",
      "keywords": [
        "AWS Lambda",
        "Amazon DynamoDB",
        "Amazon API Gateway",
        "Amazon SQS",
        "Amazon SNS",
        "Amazon EventBridge",
        "AWS SES",
        "Amazon S3",
        "AWS Stepfunctions",
        "AWS WAF",
        "AWS CloudFront",
        "Amazon Cognito",
        "AWS Systems Manager",
        "AWS Secrets Manager",
        "AVP",
        "AgentCore",
        "Bedrock"
      ]
    },
    {
      "name": "Architecture and Design",
      "level": "5",
      "keywords": ["Microservices", "Domain-Driven Design", "Event Driven Architecture", "API Lifecycle Management"]
    },
    {
      "name": "Integration",
      "level": "5",
      "keywords": ["Mobile Networks", "Smart-Homes", "IT Networks"]
    },
    {
      "name": "Software Languages",
      "level": "4",
      "keywords": [
        "Python",
        "JavaScript",
        "TypeScript",
        "Node.js",
        "Tcl/Tk",
        "C",
        "Java",
        "shell"
      ]
    },
    {
      "name": "Software Technologies",
      "level": "4",
      "keywords": ["CDK", "SAM", "CloudFormation", "Git", "GitHub", "CodeBuild", "Kubernetes", "Docker", "Packer", "Agile", "Terraform", "JIRA", "Confluence", "Asana"],
    },
    {
      "name": "Web Development",
      "level": "4",
      "keywords": [
        "HTML5",
        "CSS3",
        "Svelte",
        "JavaScript",
        "jQuery",
        "Knockout.js",
        "React",
        "Angular",
        "Gulp",
        "Grunt",
        "Bootstrap",
        "Foundation",
        "Express",
        "Flask",
        "FastAPI"
      ]
    },
    {
      "name": "Datastores",
      "level": "4",
      "keywords": [
        "DynamoDB",
        "PostgreSQL",
        "SQLite",
        "MySQL",
        "Oracle",
        "MongoDB",
        "Redis",
        "Memcached",
        "Cosmos DB"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native or bilingual proficiency"
    },
    {
      "language": "Spanish",
      "fluency": "Limited working"
    },
    {
      "language": "German",
      "fluency": "Elementary"
    },
    {
      "language": "Mandarin",
      "fluency": "Elementary"
    },
    {
      "language": "Japanese",
      "fluency": "Limited working"
    }
  ],
  "references": [
    {
      "name": "Bryon Donahue (Lead-Technical Architect at AT&T)",
      "reference": "I worked with Brett for several years. He was a contributor to AT&T’s API platform and standards. Furthermore, we’d often consult with one another when confronted with difficult API problems. \n\nBrett is an API expert. He’s worked on a large number of API projects that span wide variety of domains. Few people have the breadth and depth of API experience as Brett.\n\nBeyond, his technical skills, Brett is the kind of person that people look to as a leader due to his strong oral and written communication skills and his natural ability to empathize with others. Moreover, you can count on Brett to deliver on his commitments."
    },
    {
      "name": "Tish St. Germain (Product leadership throughout lifecycle. Integrator of software & hardware development using Scaled Agile methodology.)",
      "reference": "I’ve had the pleasure of managing Brett Schwarz for the past 3 years.  Brett is passionate about good, clean, simple API Design and adherence to standards.  He regularly demonstrates his mastery of technical tools and methodologies when providing recommendations to both project and tool enhancement initiatives.  He is recognized as the lead subject matter expert at AT&T on the REST protocol, responsible for approving all new API designs, writing technical blogs, as well as creating training and development tools.  Brett understands that technology changes fast and he works hard to keep his skillset up to date.  Brett would be a significant asset to any team looking to leverage or deploy API’s in their architectural designs."
    },
    {
      "name": "Karthic Raghavan (Principal Technical Architect at AT&T Services Inc)",
      "reference": "I have worked with Brett for the past 7-8 years, and he has always gone above and beyond what he was asked to do. He always strives to improve products, services, and processes. He has great attention to detail and does the job the right way. He is very personable and a pleasure to work with.\n\nI have come across many people who claim themselves to be an expert in REST API Design and Architecture but many of them are not even close to be an expert in it. But I can say with utmost confidence that BRETT is an TRUE expert in REST API Design and Architecture and a GURU in it. I have not come across anybody who is better than him in it in the industry till now. He is an pioneer in it working alongside with me as a co-lead in the North Bound REST API architecture for an REST API based gateway."
    },
    {
      "name": "Dale Western (Systems Architect at AT&T)",
      "reference": "It has been a pleasure working with Brett for many reasons.\n\nHe is a knowledgeable developer, very experienced in API design, documentation, construction and testing.  Brett has provided consultation to numerous teams at AT&T in all these areas.  Brett is very approachable, friendly and helpful.  You can count on Brett to deliver on his commitments.\n\nBrett grasps the latest trends and technologies in the field, pursuing them of his out initiative.  He has shared his knowledge and taught others the best practices he has acquired.\n\nI have thoroughly enjoyed the 5+ years I worked with Brett and would work with him again if the opportunity presented itself."
    },
    {
      "name": "Ed Lambert (Director, New Product Development Engineering - AT&T Research Labs)",
      "reference": "Brett worked on my team for many years, and was a key leader in pushing forward good API design.  Brett has outstanding skills as both a coder and an architect that can understand business use cases, data models, and how to design highly reusable APIs.  On top of that, however, Brett did incredible work on his own initiative to build tooling sets to make API creation faster and easier for other developers.  \n\nBrett is a truly outstanding senior technologist and I consider myself fortunate to have worked with him."
    },
    {
      "name": "Claudia (Gomez) Heidinger (Scrum Master (SAFe Agile) at AT&T)",
      "reference": "I worked with Brett on the API Delivery team for almost 3 years. Whenever Brett engaged my team of software architects, the practice was innovative, results-oriented, and always drove toward improving the life our Developer customer base. Along with possessing strong technical knowledge, Brett is a great listener, able to locate solution by collaborating with others. I experienced effort Brett drove to automate how API specifications are created, along with a separate effort to automate the entry and requirements process for teams to submit request for their APIs to be reviewed and approved by a Governance Board. Both efforts saved many hours of administrative work and increased teams’ efficiency with an automated experience. Given the opportunity to collaborate with Brett again, I would jump at the chance! I am confident that Brett would be an amazing addition to any team. As a plus, Brett is a great guy with a great sense of humor!"
    },
    {
      "name": "Paul Dubuc (Senior Management Consultant – Program Manager)",
      "reference": "Brett is an extremely capable, reliable, and productive Engineer who I would be more than happy to work with again. He was an influential member of the team and instilled respect in every interaction. I can recall key instances when his input during times of crisis led to immediately diffuse tensions with practical steps to reaching a solution. He possesses a great disposition and uncanny ability to take on new challenges and find solutions. Highly recommended!"
    },
    {
      "name": "Rajender Saini (Partner Engineer (Pre/Post Sales) at The Climate Corporation)",
      "reference": "I had the pleasure of working with Brett for more than 4 years at the AT&T. As an architect and technical lead Brett's have the ability to command a room and get people on board with ideas—even people who were initially on completely different pages. As a team member or a leader, Brett earns my highest recommendation."
    },
    {
      "name": "Anandprasanna Gaitonde (Solutions Architect at Amazon Web Services (AWS))",
      "reference": "I worked with Brett as part of the API Developer Program at A&T, where he provide guidance and direction towards the API architecture and design for APIs. This greatly helped the team to create a user friendly and streamlined API interface for external partners. His work on developer experience with APIs and his relentless pursuit for driving towards an optimal design was seen in several projects. His contribution towards standardizing API best practices and design across the organization is truly commendable. He would be great asset to have on teams that are working on large scale solution architecture and design. I look forward to working with him again."
    },
    {
      "name": "Sayee Gurumurthy (Enterprise Architect, Visionary and Entrepreneur)",
      "reference": "I worked with Brett for more than 5 years and is a great enthusiastic & approachable leader. His mastery on API design and documentation, has been critical in launching many successfully APIs in marketplace. Along with his API design skills, he has been leading in building tools for API creation, specification creation and development. \n\nHe is avid leaner and is curios to learning new technology and build tools to support his concepts. He is a great enthusiastic technical leader, who can take a concept from initiation to completion stage.  Will be willing to work with him again as opportunity permits."
    }
  ]
}
